11/data/attachments/54317522c1f33a36.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Joel_decide_Friend_60671_3</nif:username>
            <nif:friendToBeRequested>soap_friends_7fb622e7-19d7-4578-9585-8a3d2f768098</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>